* DONE add program that controls all
  CLOSED: [2016-09-22 Thu 13:05]
maybe is the real wisdom.rb and the actual wisdom is more a pdf_interface class
the program should [/]:
  - [X] get all the pdf folders
  - [X] folder.each get pdf_list
  - [X] pdf_list.each process pdf, get title, authors, abstract, filename
  - [X] save extracted pdf to mongo

* DONE clean up code
  CLOSED: [2016-10-10 Mon 12:52]
* DONE check mongo for already processed pdf papers
  CLOSED: [2016-10-05 Wed 11:19]
* DONE add with_error_handling method, from Avdi, rubytapas
  CLOSED: [2016-10-05 Wed 11:20]
* DONE add pdf_file struct, so it's easier to handle
  CLOSED: [2016-10-23 Sun 09:41]
queue = Queue.new
#+BEGIN_SRC ruby
Pdf = Struct.new(:filename, :path) do
  def to_s
    "#{:path + :filename}"
  end
end
#+END_SRC


* DONE split wisdom into bin & lib files
  CLOSED: [2016-10-23 Sun 09:41]
* TODO move to threads
* TODO test in jruby & rubinius

* benchmark
** wave server 1 core
| #files | #threads | time (s) | speed (s/file) |
|--------+----------+----------+----------------|
|    117 |        4 |  556.859 |      4.7594786 |
|    114 |       10 |  499.278 |      4.3796316 |
|    109 |       20 |  524.119 |      4.8084312 |
|    119 |        1 |  539.582 |      4.5343025 |
|    110 |       15 |   506.13 |      4.6011818 |
|        |          |          |                |
#+TBLFM: $4=$3/$1::@2$3=9*60 + 16.859::@3$3=8*60 + 19.278::@4$3=8*60 + 44.119::@5$3=8*60+59.582::@6$3=8*60 + 26.13

** thunderstorm 4 cores
| interpreter | #files | #threads | time (s) | speed (s/file) | obs           |
|-------------+--------+----------+----------+----------------+---------------|
| MRI         |   2315 |        1 | 3407.357 |      1.4718605 |               |
| MRI         |   2315 |        4 | 4153.683 |      1.7942475 |               |
| MRI         |   2315 |       10 |          |              0 |               |
| jruby       |   2307 |       10 |   542.97 |     0.23535761 |               |
| jruby       |   1598 |        4 |  693.169 |     0.43377284 | out of memory |
| jruby       |   2305 |       20 |    549.5 |     0.23839479 |               |
| jruby       |   2301 |       30 |  567.189 |     0.24649674 |               |
| jruby       |   2294 |        8 | 1909.737 |     0.83249215 | out of memory |
| jruby       |   2293 |       15 | 1111.033 |     0.48453249 |               |
| jruby       |   2306 |       12 |  525.458 |     0.22786557 |               |
| rubinius    |        |       12 |          |            0/0 | error         |
| jruby       |   2299 |       12 | 1497.472 |     0.65135798 |               |
| jruby       |   3553 |       12 | 2157.493 |     0.60723135 |               |
#+TBLFM: $5=$4/$2::@2$3=1::@3$3=4::@5$4=9*60 + 2.97::@6$4=11*60 + 33.169::@7$4=9*60+9.5::@8$4=9*60 + 27.189::@9$4=31*60+49.737::@10$4=18*60+31.033::@11$4=8*60+45.458::@13$4=24*60+57.472::@14$4=35*60+57.493
